app/controllers/mentee_applications/build_controller.rb

  def show
    @mentee = MenteeApplication.find_by(id: params[:mentee_application_id])
---
SELECT  "mentee_applications".* FROM "mentee_applications" WHERE "mentee_applications"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @mentee = MenteeApplication.find_by(id: params[:mentee_application_id])
    return (redirect_to root_path, notice:  "Incompleted application are deleted after 24 hours - please apply again") unless @mentee

    case step
    when :programming_experience
      if params[:known_programming_languages].present? && params[:known_programming_languages].include?("other")
        params[:known_programming_languages] << params[:other_language]
      elsif params[:known_programming_languages].blank?
        params[:known_programming_languages] = []
      end
      @mentee.update_attributes(mentee_params.merge({known_programming_languages: params[:known_programming_languages]}))
---
SELECT  "mentee_applications".* FROM "mentee_applications" WHERE "mentee_applications"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "mentee_applications" SET "motivation" = $1, "english_level" = $2, "experience" = $3, "build_step" = $4, "updated_at" = $5 WHERE "mentee_applications"."id" = $6  [["motivation", "motivation"], ["english_level", "very well"], ["experience", "exp"], ["build_step", "experience"], ["updated_at", "2015-09-06 12:28:07.514658"], ["id", 1]]