app/controllers/mentor_applications/build_controller.rb

  def show
    @mentor = MentorApplication.find_by(id: params[:mentor_application_id])
---
SELECT  "mentor_applications".* FROM "mentor_applications" WHERE "mentor_applications"."id" = $1 LIMIT 1  [["id", 5]]

  def update
    @mentor = MentorApplication.find_by(id: params[:mentor_application_id])
    return (redirect_to root_path, notice:  "Incompleted application are deleted after 24 hours - please apply again") unless @mentor

    case step
    when :experience
      @mentor.update_attributes(mentor_params.merge({mentee_level: params[:mentee_level]}))
---
SELECT  "mentor_applications".* FROM "mentor_applications" WHERE "mentor_applications"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "mentor_applications" SET "application_idea" = $1, "concept_explanation" = $2, "build_step" = $3, "engagements" = $4, "sources" = $5, "updated_at" = $6 WHERE "mentor_applications"."id" = $7  [["application_idea", ""], ["concept_explanation", ""], ["build_step", "details"], ["engagements", nil], ["sources", nil], ["updated_at", "2015-09-06 09:40:08.674631"], ["id", 7]]